package program_1;

/**
 * Вывести на консоль текст “Hello World!”:
 *
 * Скачать и установить IntelliJ IDEA.
 *
 * Написать первую программу, которая выводит в консоль строку “Hello World!”.
 *
 * Подключиться к GitHub, залить программу в созданный репозиторий.
 */

public class Program {
    public static void main(String[] args){
    System.out.println("Hello World");

    }
}
