package types_2;

/**
 *Задача №2 - Типы данных
 * Создание переменных:
 *
 * Создайте переменную типа с плавающей точкой с наибольшим диапазоном чисел.
 * Присвойте ей произвольное дробное значение.
 *
 * Создайте переменную целочисленного типа с наименьшим диапазоном чисел.
 * Присвойте  ей наибольшее возможное значение.
 */

public class Types {
    public static void main(String[]args) {
        // Переменная типа с плавающей точкой с наибольшим диапазоном чисел. Произвольное дробное значение.
        double num1 = 3.14;
        //Переменная целочисленного типа с наименьшим диапазоном чисел. Наибольшее возможное значение.
        byte num2 = 127;
    }
}
